app/Repositories/Page/PageRepository.php

insert into `pages` (`user_id`, `title`, `slug`, `excerpt`, `description`, `published`, `meta_title`, `created_at`, `updated_at`) values (4, 'fdsg', 'fdsg', 'dfgfd', '<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>dfgfdgdfg</p></body></html>\n', 1, 'dgfd', '2022-01-23 11:42:08', '2022-01-23 11:42:08')
insert into `keywords` (`title`) values ('gdfgfg')
select * from `keywords` where (`title` = 'gdfgfg') limit 1
insert into `page_keywords` (`keyword_id`, `page_id`) values (17, 10)
---
    public function save(Request $request)
    {
        $page = $this->model->create([
            'user_id' => auth()->user()->id,
            'title' => $request->input('title'),
            'slug' => $this->slugify($request->input('title')),
            'excerpt' => $request->input('excerpt'),
            'description' => $request->input('description'),
            'published' => filter_var($request->input('published'), FILTER_VALIDATE_BOOLEAN),
            'meta_title' => $request->input('meta_title'),
        ]);

        // Keywords
        $newKeywords = explode(',', $request->input('keywords'));
        $keywordIds = [];

        foreach ($newKeywords as $keyword) {
            $keyword = Keyword::firstOrCreate(['title' => $keyword]);
            array_push($keywordIds, $keyword->id);
        }

        $page->keywords()->sync($keywordIds);

delete from `page_keywords` where `page_keywords`.`page_id` = 10
delete from `page_links` where `page_links`.`page_id` = 10 and `page_links`.`page_id` is not null
delete from `pages` where `id` = 10
---
    public function delete(int $id)
    {
        $page = $this->model->findOrFail($id);
        $page->keywords()->detach();
        $page->pageLinks()->delete();

        return $page->delete();