app/Repositories/Article/ArticleRepository.php

    public function getAllArticleCount(): int
    {
        return Article::all()->count();
---
select count(*) as aggregate from `articles` where `created_at` > '2022-01-22 11:40:17' group by HOUR(created_at)

    public function getArticle($slug)
    {
        return $this->model->with(['categories' => function ($q) use ($slug) {
            $q->with(['articles' => function ($sq) use ($slug) {
                $sq->select('article_id', 'title', 'slug', 'published', 'viewed', 'image', 'featured', 'description')
                    ->where('published', '=', true);
            }]);
        }])
            ->where('slug', $slug)
            ->first();
---
select `id`, `title`, `slug`, `featured`, `published`, `image`, `viewed`, `description` from `articles` order by `viewed` desc limit 3