app/Repositories/Article/ArticleRepository.php

    public function save(Request $request)
    {


        $image = $request->image;
        if ($image) {
            $image_ext = $image->getClientOriginalExtension();
            $image_full_name = time() . '.' . $image_ext;
            $upload_path = 'assets/images/';
            $image_url = $upload_path . $image_full_name;

            $image->move($upload_path, $image_full_name);
        } else {
            $image_url = '';
        }

        $article = Article::create([
            'user_id' => auth()->user()->id,
            'title' => $request->input('title'),
            'slug' => $this->slugify($request->input('title')),
            'excerpt' => $request->input('excerpt'),
            'featured' => filter_var($request->input('featured'), FILTER_VALIDATE_BOOLEAN),
            'description' => $request->input('description'),
            'published' => filter_var($request->input('published'), FILTER_VALIDATE_BOOLEAN),
            'image_disk' => $this->disk,
            'meta_title' => $request->input('meta_title'),
            'image' => $image_url,
        ]);
        // Category
        $article->categories()->sync([$request->input('categories')]);
---
insert into `articles` (`user_id`, `title`, `slug`, `excerpt`, `featured`, `description`, `published`, `image_disk`, `meta_title`, `image`, `created_at`, `updated_at`) values (4, 'fsdfsdf', 'fsdfsdf', 'sdfd', 0, '<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>sdfsdfsdf]</p><p><img src=\"http://127.0.0.1:8000/uploads/16429350360.png\"></p></body></html>\n', 1, 'public', 'sdfsddf', 'assets/images/1642935036.jpg', '2022-01-23 11:50:36', '2022-01-23 11:50:36')
insert into `article_categories` (`article_id`, `category_id`) values (18, 1)

        $keywordIds = [];

        foreach ($newKeywords as $keyword) {
            $keyword = Keyword::firstOrCreate(['title' => $keyword]);
            array_push($keywordIds, $keyword->id);
        }

        $article->keywords()->sync($keywordIds);
---
insert into `keywords` (`title`) values ('fdsfdsf')
select * from `keywords` where (`title` = 'fdsfdsf') limit 1
insert into `article_keywords` (`article_id`, `keyword_id`) values (18, 19)

    public function delete(int $id)
    {
        $article = Article::findOrFail($id);
        File::delete($article->image);
        $article->categories()->detach();
        $article->keywords()->detach();

        return $article->delete();
---
select * from `articles` where `articles`.`id` = 17 limit 1
delete from `article_categories` where `article_categories`.`article_id` = 17
delete from `article_keywords` where `article_keywords`.`article_id` = 17
delete from `article_keywords` where `article_keywords`.`article_id` = 20
delete from `article_categories` where `article_categories`.`article_id` = 20
delete from `articles` where `id` = 17

    public function paginate($perPage = 10)
    {
        return Article::latest()
            ->with(['categories'])
            ->when(request()->has('category'), function ($q) {
                $q->whereHas('categories', function ($sq) {
                    $sq->where('category_id', \request('category'));
                });
            })
            ->when(request()->has('is_published'), function ($q) {
                $q->where('published', (bool)request('is_published'));
            })
            ->when(\request()->has('search'), function ($q) {
                $q->where('title', 'LIKE', '%' . \request('search') . '%');
            })
            ->orderBy('viewed', 'desc')
            ->paginate($perPage);
---
select * from `articles` order by `created_at` desc, `viewed` desc limit 10 offset 0
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select count(*) as aggregate from `articles`

    public function getArticleCount()
    {
        return Article::where('created_at', '>', Carbon::now()->subDays(1))
            ->groupBy(\DB::raw('HOUR(created_at)'))
            ->count();
---
select count(*) as aggregate from `articles` where `created_at` > '2022-01-22 11:34:53' group by HOUR(created_at)

    public function getAllArticleCount(): int
    {
        return Article::all()->count();
---
select count(*) as aggregate from `articles` where `created_at` > '2022-01-22 12:25:52' group by HOUR(created_at)

    private function baseQuery(int $categoryId = 1)
    {
        return $this->model->whereHas('categories', function ($q) use ($categoryId) {
            $q->where('is_published', '=', 0);
            $q->when($categoryId !== 1, function ($sq) use ($categoryId) {
                $sq->where('category_id', $categoryId);
            });
        });
---
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

    public function publishedArticles(int $limit)
    {
        return $this->model
            ->select('id', 'title', 'slug', 'featured', 'published', 'image', 'viewed', 'description')
            ->with('categories')
            ->latest()
            ->limit($limit)
            ->get();
---
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1, 3, 19)

    public function getArticle($slug)
    {
        return $this->model->with(['categories' => function ($q) use ($slug) {
            $q->with(['articles' => function ($sq) use ($slug) {
                $sq->select('article_id', 'title', 'slug', 'published', 'viewed', 'image', 'featured', 'description')
                    ->where('published', '=', true);
            }]);
        }])
            ->where('slug', $slug)
            ->first();
---
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (19)
select `id`, `title`, `slug`, `featured`, `published`, `image`, `viewed`, `description` from `articles` where `featured` = 1 order by `created_at` desc limit 3

    public function getAllTags()
    {
        return Keyword::limit(15)->inRandomOrder()->get();
---
select * from `keywords` order by RAND() limit 15

    public function getArticlesByTag($perPage, array $keywordIds, $includeFavorites = false)
    {
        $q = $this->model->whereHas('keywords', function ($q) use ($keywordIds) {
            $q->whereIn('keyword_id', $keywordIds);
        })
            ->with('categories:id,name,slug')
            ->with('keywords:id,title')
            ->where('published', true)
            ->when($includeFavorites, function ($q) {
                $q->with(['favorites']);
            })
            ->select('id', 'title', 'slug', 'featured', 'published', 'image', 'viewed', 'description')
            ->latest();

        return $perPage === 4 ? $q->limit($perPage)->get() : $q->paginate($perPage);
---
select * from `keywords` order by RAND() limit 15