app/Http/Controllers/WebsiteController.php

select `name`, `slug` from `categories` where `is_published` = 0 order by `position` asc
select * from `page_links` where `key` = 'footer_pages'
select `id`, `title`, `slug` from `pages` where `pages`.`id` in (9)
---
    public function __construct(ArticleRepository $articleRepository)
    {
        $this->articleRepository = $articleRepository;
        $tags = $this->articleRepository->getAllTags();
        $tagTitles=[];
        foreach ($tags as $tag)
            array_push($tagTitles,$tag->title);
        $categories = Category::select('name', 'slug')->where('is_published', 0)->orderBy('position', 'asc')->pluck('name', 'slug');
        $featuredArticles = $this->articleRepository->publishedArticles( 3);
        $this->homePageSeoData = json_decode(setting()->get('general'), true);
        $this->baseSeoData = [
            'title' => 'A travel blog site',
            'description' => 'A travel blog site',
            'keywords' => $tagTitles,

//            'image' => $this->homePageSeoData['home_page_image_url'] ?
//                Storage::disk('public')->url('settings/' . basename($this->homePageSeoData['home_page_image_url']))
//                :
//                asset('asset/logo.png'),
            'type' => 'website',
            'site' => env('APP_URL'),
            'app_name' => env('APP_NAME'),
            'robots' => 'index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1'
        ];

        $footerPages = \Cache::remember('footer_pages', config('cache.default_ttl'), function () {
            return PageLink::where('key', 'footer_pages')->with('page:id,title,slug')->get()->toArray();

update `articles` set `viewed` = 1, `articles`.`updated_at` = '2022-01-23 11:54:24' where `id` = 19
---
    public function articleDetails($slug)
    {
        $article = $this->articleRepository->getArticle($slug);
        if (!$article) {
            return $this->renderPage($slug);
        }
        $category = $article['categories'][0];
        $similarArticles = $this->articleRepository->getSimilarArticles( 2);
        $tags = $article->keywords;
        $tagTitles=[];
        foreach ($tags as $tag)
            array_push($tagTitles,$tag->title);
        $segments = [
            [
                'name' => $article['categories'][0]['name'],
                'url' => route('category', [
                    'slug' => $category['slug']
                ])
            ],
            ['name' => $article['title'], 'url' => url($slug)]
        ];
        $cacheKey = request()->ip() . $slug;
        \Cache::remember($cacheKey, 60, function () use ($article) {
            $article->viewed = $article->viewed + 1;
            $article->save();